In [2]:
import mysql.connector

In [3]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
    password="tamrapathi3383",
    database="school_db"
)
print(mydb)
mycursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000024B899C1160>

In [4]:
import mysql.connector

# Step 1: Connect to MariaDB/MySQL
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="tamrapathi3383"
)

# Step 2: Create a cursor
mycursor = mydb.cursor()

# Step 3: Create the database (only if not exists)
mycursor.execute("CREATE DATABASE IF NOT EXISTS school_db")

print("Database school_db created or already exists.")

Database school_db created or already exists.

In [5]:
mycursor.execute("SHOW TABLES")

ProgrammingError: 1046 (3D000): No database selected

In [ ]:
for x in mycursor:
  print(x)

('customers',)
('customers1',)

In [ ]:
import mysql.connector
import pandas as pd

# connect to schools_db
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",
    database="schools_db"
)
cursor = mydb.cursor()

# --- Insert Students ---
students_df = pd.read_csv("students.csv")
student_records = students_df.values.tolist()

cursor.executemany(
    "INSERT INTO students (student_id, name, age, grade, email) VALUES (%s, %s, %s, %s, %s)",
    student_records
)

# --- Insert Courses ---
courses_df = pd.read_csv("courses.csv")
course_records = courses_df.values.tolist()

cursor.executemany(
    "INSERT INTO courses (course_id, course_name, instructor) VALUES (%s, %s, %s)",
    course_records
)

# --- Insert Enrollments ---
enroll_df = pd.read_csv("enrollments.csv")
enroll_records = enroll_df.values.tolist()

cursor.executemany(
    "INSERT INTO enrollments (enroll_id, student_id, course_id) VALUES (%s, %s, %s)",
    enroll_records
)

mydb.commit()
print("âœ… Data inserted from CSVs")

âœ… Data inserted from CSVs

In [ ]:
#1.Write a Python program to connect to MySQL and print the list of all available databases. 
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383"
)
cursor = mydb.cursor()
cursor.execute("SHOW DATABASES")

for db in cursor:
    print(db)

('games_db',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('school_db',)
('schools_db',)
('sys',)
('world',)

In [ ]:
#2. Create a function in Python to create the tables (students, courses, enrollments) in school_db.
def create_tables():
    conn = mysql.connector.connect(
        host="localhost",
        user="root",
        password="tamrapathi3383",
        database="schools_db"
    )
    cursor = conn.cursor()

    cursor.execute("""
    CREATE TABLE IF NOT EXISTS students (
        student_id INT PRIMARY KEY,
        name VARCHAR(100),
        age INT,
        grade VARCHAR(5),
        email VARCHAR(100)
    )""")

    cursor.execute("""
    CREATE TABLE IF NOT EXISTS courses (
        course_id INT PRIMARY KEY,
        course_name VARCHAR(100),
        instructor VARCHAR(100)
    )""")

    cursor.execute("""
    CREATE TABLE IF NOT EXISTS enrollments (
        enroll_id INT PRIMARY KEY,
        student_id INT,
        course_id INT,
        FOREIGN KEY (student_id) REFERENCES students(student_id),
        FOREIGN KEY (course_id) REFERENCES courses(course_id)
    )""")
    print("âœ… Tables created")

create_tables()

âœ… Tables created

In [ ]:
#3.Write a Python program to insert multiple students and courses into the respective tables using executemany().
import mysql.connector
 
def insert_multiple():
    with mysql.connector.connect(
        host="localhost",
        user="root",
        password="tamrapathi3383",
        database="school_db"
    ) as conn, conn.cursor() as cur:
 
        data = [
            ("INSERT INTO students (name, age, grade) VALUES (%s, %s, %s)", [
                ("zanel", 18, "C"),
                ("uma", 23, "A"),
                ("wendy", 22, "B"),
                ("xander", 22, "A"),
                ("victor", 19, "A")
            ]),
            ("INSERT INTO courses (course_name, instructor) VALUES (%s, %s)", [
                ("Mathematics", "Dr. Smith"),
                ("physics", "Dr. Johnson"),
                ("chemistry", "Dr.brown"),
                ("biology", "prof.Lee")
            ])
        ]
 
        for query, rows in data:
            cur.executemany(query, rows)
            print(f"Inserted {cur.rowcount} rows.")
 
        conn.commit()
 
if __name__ == "__main__":
    insert_multiple()

Inserted 5 rows.
Inserted 4 rows.

In [ ]:
#4. Fetch and print all rows from the students table in a tabular format.

import mysql.connector
import pandas as pd 

# connect with database selected
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",
    database="schools_db"   # ðŸ‘ˆ Add your DB here
)

cursor = conn.cursor()

cursor.execute("SELECT * FROM students")
rows = cursor.fetchall()

# get column names
columns = [desc[0] for desc in cursor.description]     

# convert to DataFrame
df = pd.DataFrame(rows, columns=columns)               

print("\nStudents Table:")
print(df.to_string(index=False))

Students Table:
 student_id     name  age grade                 email school_email
          1    Zane1   18     C    zane149@school.com         None
          2     Uma2   23     A     uma254@school.com         None
          3   Wendy3   22     B   wendy342@school.com         None
          4  Xander4   22     A  xander457@school.com         None
          5  Victor5   19     A  victor592@school.com         None
          6     Ian6   19     D     ian688@school.com         None
          7     Leo7   22     A     leo779@school.com         None
          8    Paul8   24     B    paul841@school.com         None
          9   Wendy9   23     B   wendy946@school.com         None
         10    Leo10   23     A    leo1045@school.com         None
         11    Uma11   18     C    uma1197@school.com         None
         12   Rita12   18     B   rita1234@school.com         None
         13   Yara13   22     B   yara1324@school.com         None
         14    Bob14   19     C    bob1437@school.com         None
         15 Quincy15   24     A quincy1568@school.com         None
         16   Tina16   19     A   tina1652@school.com         None
         17  Alice17   25     B  alice1785@school.com         None
         18    Sam18   20     B    sam1812@school.com         None
         19   Paul19   23     A   paul1942@school.com         None
         20 Victor20   19     D victor2032@school.com         None
         21  Frank21   23     A  frank2110@school.com         None
         22 Victor22   18     A victor2282@school.com         None
         23  Karen23   25     A  karen2315@school.com         None
         24  Grace24   24     D  grace2472@school.com         None
         25 Quincy25   25     A quincy2517@school.com         None
         26   Mona26   20     D   mona2678@school.com         None
         27    Uma27   22     B    uma2786@school.com         None
         28   Nina28   23     B   nina2861@school.com         None
         29    Ian29   23     B    ian2973@school.com         None
         30   Tina30   23     A   tina3025@school.com         None
         31   Nina31   22     B    nina318@school.com         None
         32 Hannah32   21     A hannah3256@school.com         None
         33  David33   25     D  david3347@school.com         None
         34  Wendy34   22     B  wendy3490@school.com         None
         35  Frank35   25     C  frank3527@school.com         None
         36   Paul36   22     D   paul3628@school.com         None
         37    Ian37   21     D    ian3793@school.com         None
         38   Paul38   20     C   paul3897@school.com         None
         39 Hannah39   18     A hannah3982@school.com         None
         40   Zane40   21     A   zane4017@school.com         None
         41    Ian41   24     D   ian41100@school.com         None
         42 Quincy42   24     C quincy4215@school.com         None
         43 Quincy43   25     D quincy4312@school.com         None
         44   Tina44   19     C   tina4444@school.com         None
         45 Xander45   23     C xander4560@school.com         None
         46   Zane46   25     C   zane4632@school.com         None
         47    Eva47   19     D    eva4718@school.com         None
         48    Leo48   22     B    leo4847@school.com         None
         49    Uma49   25     A    uma4966@school.com         None
         50    Bob50   22     D    bob5041@school.com         None
         51  Karen51   18     A  karen5197@school.com         None
         52 Hannah52   23     A hannah5259@school.com         None
         53    Bob53   21     C    bob5354@school.com         None
         54    Leo54   18     C    leo5426@school.com         None
         55   Yara55   22     A   yara5546@school.com         None
         56    Eva56   19     C     eva569@school.com         None
         57   Nina57   21     B    nina572@school.com         None
         58    Eva58   20     A    eva5835@school.com         None
         59  Oscar59   21     B   oscar591@school.com         None
         60   Yara60   18     B   yara6031@school.com         None
         61  Oscar61   23     D   oscar618@school.com         None
         62   Rita62   23     C   rita6264@school.com         None
         63 Victor63   20     D victor6329@school.com         None
         64 Xander64   19     D xander6467@school.com         None
         65 Hannah65   22     D hannah6552@school.com         None
         66   Nina66   25     D   nina6651@school.com         None
         67 Victor67   18     A victor6738@school.com         None
         68  Karen68   18     A  karen6876@school.com         None
         69  Grace69   18     D   grace694@school.com         None
         70   Jack70   24     A   jack7070@school.com         None
         71   Nina71   23     B   nina7115@school.com         None
         72    Ian72   22     D    ian7238@school.com         None
         73  Grace73   19     A  grace7369@school.com         None
         74  Grace74   24     C  grace7467@school.com         None
         75 Quincy75   23     D quincy7569@school.com         None
         76  Oscar76   19     D  oscar7617@school.com         None
         77  Grace77   22     D  grace7770@school.com         None
         78    Ian78   22     D    ian7836@school.com         None
         79 Xander79   24     C xander7975@school.com         None
         80   Tina80   22     D   tina8097@school.com         None
         81  Wendy81   20     A  wendy8111@school.com         None
         82  Karen82   23     B  karen8295@school.com         None
         83    Leo83   18     C    leo8360@school.com         None
         84    Bob84   18     A    bob8446@school.com         None
         85   Rita85   18     A   rita8526@school.com         None
         86  Alice86   21     B  alice8639@school.com         None
         87    Sam87   19     C    sam8780@school.com         None
         88  Wendy88   23     A  wendy8858@school.com         None
         89   Tina89   21     C   tina8979@school.com         None
         90   Zane90   25     D   zane9073@school.com         None
         91   Tina91   21     D    tina917@school.com         None
         92  Wendy92   19     C  wendy9277@school.com         None
         93 Quincy93   19     A quincy9313@school.com         None
         94    Eva94   24     C    eva9470@school.com         None
         95   Tina95   25     D   tina9561@school.com         None
         96    Ian96   25     C     ian961@school.com         None
         97   Mona97   22     C   mona9756@school.com         None
         99    Bob99   23    B+    bob9925@school.com         None
        100  Paul100   19     B  paul10052@school.com         None

In [ ]:
#4.
conn= mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",
    database="schools_db"
)

cursor = conn.cursor()

delete_duplicates = """
DELETE t1 FROM students t1
JOIN students t2 
ON t1.student_id > t2.student_id 
AND t1.name = t2.name 
AND t1.age = t2.age 
AND t1.grade = t2.grade;
"""

cursor.execute(delete_duplicates)
mydb.commit()

print("Duplicates removed successfully!")

Duplicates removed successfully!

In [ ]:
#5. Write a program to update the grade of a student (given student_id) via a Python input prompt. 
import mysql.connector

cursor = conn.cursor()

sql = "UPDATE students SET grade = %s WHERE student_id = %s"
val = ("B+", 99)   # example: update student_id=99
cursor.execute(sql, val)

conn.commit()
print(cursor.rowcount, "record updated.")

0 record updated.

In [ ]:
#6.Delete a student from the students table using Python input for student_id. 
import mysql.connector


cursor = conn.cursor()

# Create enrollments table if it doesn't exist (with cascade)
cursor.execute("""
CREATE TABLE IF NOT EXISTS enrollments (
    enrollment_id INT PRIMARY KEY AUTO_INCREMENT,
    student_id INT,
    course_id INT,
    FOREIGN KEY (student_id) REFERENCES students(student_id) ON DELETE CASCADE,
    FOREIGN KEY (course_id) REFERENCES courses(course_id) ON DELETE CASCADE
)
""")

# Now delete student directly (enrollments will auto-delete because of cascade)
sql_delete_student = "DELETE FROM students WHERE name = %s"
val = ("Leo98",)

cursor.execute(sql_delete_student, val)
conn.commit()

print("Student (and related enrollments if any) deleted successfully.")

Student (and related enrollments if any) deleted successfully.

In [ ]:
#7.Write a Python script to insert enrollment records linking students with their courses, ensuring foreign key integrity. 
conn= mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",
    database="schools_db"
)
cursor=conn.cursor()
cursor.execute("SELECT student_id FROM students")
valid_students = {row[0] for row in cursor.fetchall()}
 
cursor.execute("SELECT course_id FROM courses")
valid_courses = {row[0] for row in cursor.fetchall()}
 
valid_enrollments, invalid_enrollments = [], []
with open("enrollments.csv") as f:
    for enroll_id, student_id, course_id in list(csv.reader(f))[1:]:
        student_id, course_id = int(student_id), int(course_id)
        if student_id in valid_students and course_id in valid_courses:
            valid_enrollments.append((enroll_id, student_id, course_id))
        else:
            invalid_enrollments.append((student_id, course_id))
 
print(f"{len(valid_enrollments)} valid enrollments to insert.")
print(f"{len(invalid_enrollments)} invalid enrollments skipped:", invalid_enrollments[:10])
 
if valid_enrollments:
    cursor.executemany("INSERT IGNORE INTO enrollments VALUES (%s, %s, %s)", valid_enrollments)
    conn.commit()
    print("Inserted successfully.")
 
cursor.execute("SELECT * FROM enrollments LIMIT 200")
print(cursor.fetchall())
 
cursor.close();
conn.close()

199 valid enrollments to insert.
0 invalid enrollments skipped: []
Inserted successfully.
[(1, 1, 1), (2, 2, 2), (3, 3, 3), (4, 4, 4), (5, 5, 5), (6, 5, 3), (7, 5, 6), (8, 6, 7), (9, 6, 4), (10, 6, 5), (11, 7, 1), (12, 8, 9), (13, 9, 9), (14, 10, 7), (15, 10, 3), (16, 10, 1), (17, 11, 3), (18, 11, 6), (19, 11, 8), (20, 12, 10), (21, 13, 2), (22, 13, 9), (23, 13, 10), (24, 14, 3), (25, 14, 1), (26, 15, 8), (27, 15, 5), (28, 15, 2), (29, 16, 6), (30, 16, 4), (31, 16, 1), (32, 17, 6), (33, 17, 1), (34, 17, 7), (35, 18, 3), (36, 19, 9), (37, 19, 1), (38, 20, 8), (39, 20, 4), (40, 20, 10), (41, 21, 7), (42, 21, 6), (43, 22, 3), (44, 22, 10), (45, 22, 9), (46, 23, 5), (47, 24, 7), (48, 24, 8), (49, 25, 9), (50, 26, 9), (51, 26, 8), (52, 26, 1), (53, 27, 6), (54, 28, 3), (55, 28, 1), (56, 29, 5), (57, 29, 3), (58, 30, 3), (59, 30, 6), (60, 30, 1), (61, 31, 4), (62, 31, 9), (63, 31, 3), (64, 32, 4), (65, 32, 9), (66, 33, 5), (67, 33, 4), (68, 34, 3), (69, 34, 8), (70, 35, 7), (71, 36, 6), (72, 36, 4), (73, 37, 2), (74, 37, 6), (75, 38, 4), (76, 39, 6), (77, 40, 4), (78, 41, 10), (79, 41, 3), (80, 42, 10), (81, 42, 5), (82, 42, 7), (83, 43, 2), (84, 44, 9), (85, 45, 6), (86, 45, 5), (87, 45, 10), (88, 46, 1), (89, 46, 10), (90, 46, 5), (91, 47, 2), (92, 48, 1), (93, 48, 4), (94, 48, 10), (95, 49, 4), (96, 49, 7), (97, 50, 7), (98, 51, 7), (99, 51, 8), (100, 51, 4), (101, 52, 2), (102, 52, 3), (103, 53, 2), (104, 53, 5), (105, 53, 4), (106, 54, 3), (107, 54, 9), (108, 54, 5), (109, 55, 6), (110, 55, 10), (111, 55, 9), (112, 56, 6), (113, 57, 2), (114, 57, 7), (115, 57, 5), (116, 58, 1), (117, 59, 9), (118, 59, 8), (119, 59, 10), (120, 60, 2), (121, 60, 4), (122, 61, 1), (123, 62, 1), (124, 63, 5), (125, 64, 3), (126, 64, 9), (127, 64, 4), (128, 65, 3), (129, 66, 3), (130, 66, 4), (131, 66, 6), (132, 67, 7), (133, 68, 3), (134, 69, 6), (135, 69, 8), (136, 69, 3), (137, 70, 7), (138, 70, 10), (139, 71, 5), (140, 71, 1), (141, 72, 3), (142, 72, 7), (143, 72, 9), (144, 73, 7), (145, 73, 10), (146, 74, 6), (147, 74, 1), (148, 74, 7), (149, 75, 2), (150, 75, 5), (151, 76, 7), (152, 76, 8), (153, 76, 9), (154, 77, 4), (155, 77, 6), (156, 77, 1), (157, 78, 2), (158, 78, 9), (159, 78, 10), (160, 79, 3), (161, 79, 5), (162, 80, 5), (163, 81, 1), (164, 81, 5), (165, 81, 6), (166, 82, 3), (167, 83, 9), (168, 83, 3), (169, 83, 2), (170, 84, 5), (171, 84, 3), (172, 85, 7), (173, 86, 3), (174, 87, 10), (175, 87, 9), (176, 87, 8), (177, 88, 5), (178, 89, 1), (179, 90, 2), (180, 91, 4), (181, 91, 1), (182, 91, 2), (183, 92, 7), (184, 92, 1), (185, 92, 8), (186, 93, 7), (187, 93, 3), (188, 94, 6), (189, 94, 10), (190, 95, 3), (191, 96, 9), (192, 96, 5), (193, 96, 2), (194, 97, 5), (195, 98, 9), (196, 98, 3), (197, 99, 7), (198, 99, 2), (199, 100, 9)]

In [6]:
#8.Fetch all students enrolled in a particular course (given course_id as input). 
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",
    database="schools_db"
)

cursor = conn.cursor()

course_id = int(input("Enter course_id to fetch enrolled students: "))

cursor.execute("""
SELECT s.student_id, s.name, s.age, s.grade, c.course_name
FROM enrollments e
JOIN students s ON e.student_id = s.student_id
JOIN courses c ON e.course_id = c.course_id
WHERE e.course_id = %s
""", (course_id,))

rows = cursor.fetchall()

print(f"\nStudents enrolled in Course {course_id}:")
if rows:
    for row in rows:
        print(row)   # (student_id, name, age, grade, course_name)
else:
    print("No students found for this course.")

Students enrolled in Course 1:
(1, 'Zane1', 18, 'C', 'Mathematics')
(7, 'Leo7', 22, 'A', 'Mathematics')
(10, 'Leo10', 23, 'A', 'Mathematics')
(14, 'Bob14', 19, 'C', 'Mathematics')
(16, 'Tina16', 19, 'A', 'Mathematics')
(17, 'Alice17', 25, 'B', 'Mathematics')
(19, 'Paul19', 23, 'A', 'Mathematics')
(26, 'Mona26', 20, 'D', 'Mathematics')
(28, 'Nina28', 23, 'B', 'Mathematics')
(30, 'Tina30', 23, 'A', 'Mathematics')
(46, 'Zane46', 25, 'C', 'Mathematics')
(48, 'Leo48', 22, 'B', 'Mathematics')
(58, 'Eva58', 20, 'A', 'Mathematics')
(61, 'Oscar61', 23, 'D', 'Mathematics')
(62, 'Rita62', 23, 'C', 'Mathematics')
(71, 'Nina71', 23, 'B', 'Mathematics')
(74, 'Grace74', 24, 'C', 'Mathematics')
(77, 'Grace77', 22, 'D', 'Mathematics')
(81, 'Wendy81', 20, 'A', 'Mathematics')
(89, 'Tina89', 21, 'C', 'Mathematics')
(91, 'Tina91', 21, 'D', 'Mathematics')
(92, 'Wendy92', 19, 'C', 'Mathematics')

In [ ]:
#9.Write a program to display students who are not enrolled in any course.
import mysql.connector
cursor = conn.cursor()

cursor.execute("""
SELECT s.student_id, s.name 
FROM students s 
LEFT JOIN enrollments e ON s.student_id = e.student_id 
WHERE e.student_id IS NULL
""")

for row in cursor.fetchall():
    print(row)

(6, 'Ian6')
(7, 'Leo7')
(8, 'Paul8')
(9, 'Wendy9')
(10, 'Leo10')
(11, 'Uma11')
(12, 'Rita12')
(13, 'Yara13')
(14, 'Bob14')
(15, 'Quincy15')
(16, 'Tina16')
(17, 'Alice17')
(18, 'Sam18')
(19, 'Paul19')
(20, 'Victor20')
(21, 'Frank21')
(22, 'Victor22')
(23, 'Karen23')
(24, 'Grace24')
(25, 'Quincy25')
(26, 'Mona26')
(27, 'Uma27')
(28, 'Nina28')
(29, 'Ian29')
(30, 'Tina30')
(31, 'Nina31')
(32, 'Hannah32')
(33, 'David33')
(34, 'Wendy34')
(35, 'Frank35')
(36, 'Paul36')
(37, 'Ian37')
(38, 'Paul38')
(39, 'Hannah39')
(40, 'Zane40')
(41, 'Ian41')
(42, 'Quincy42')
(43, 'Quincy43')
(44, 'Tina44')
(45, 'Xander45')
(46, 'Zane46')
(47, 'Eva47')
(48, 'Leo48')
(49, 'Uma49')
(50, 'Bob50')
(51, 'Karen51')
(52, 'Hannah52')
(53, 'Bob53')
(54, 'Leo54')
(55, 'Yara55')
(56, 'Eva56')
(57, 'Nina57')
(58, 'Eva58')
(59, 'Oscar59')
(60, 'Yara60')
(61, 'Oscar61')
(62, 'Rita62')
(63, 'Victor63')
(64, 'Xander64')
(65, 'Hannah65')
(66, 'Nina66')
(67, 'Victor67')
(68, 'Karen68')
(69, 'Grace69')
(70, 'Jack70')
(71, 'Nina71')
(72, 'Ian72')
(73, 'Grace73')
(74, 'Grace74')
(75, 'Quincy75')
(76, 'Oscar76')
(77, 'Grace77')
(78, 'Ian78')
(79, 'Xander79')
(80, 'Tina80')
(81, 'Wendy81')
(82, 'Karen82')
(83, 'Leo83')
(84, 'Bob84')
(85, 'Rita85')
(86, 'Alice86')
(87, 'Sam87')
(88, 'Wendy88')
(89, 'Tina89')
(90, 'Zane90')
(91, 'Tina91')
(92, 'Wendy92')
(93, 'Quincy93')
(94, 'Eva94')
(95, 'Tina95')
(96, 'Ian96')
(97, 'Mona97')
(99, 'Bob99')
(100, 'Paul100')

In [ ]:
#10. Perform an INNER JOIN between students and courses using Python to show student names along with the courses they are enrolled in.
cursor = conn.cursor()

cursor.execute("""
SELECT s.name, c.course_name 
FROM students s
INNER JOIN enrollments e ON s.student_id = e.student_id
INNER JOIN courses c ON e.course_id = c.course_id
""")

for row in cursor.fetchall():
    print(row)

('Zane1', 'Mathematics')
('Uma2', 'Physics')
('Wendy3', 'Chemistry')
('Xander4', 'Biology')
('Victor5', 'History')

In [ ]:
#11.Write a Python function to search for a student by name (partial matches allowed using LIKE).
import random
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",
    database="schools_db"
)
cursor = conn.cursor()

cursor.execute("SHOW COLUMNS FROM students LIKE 'school_email'")
result = cursor.fetchone()
# Add column only if it doesn't exist
if not result:
    cursor.execute("ALTER TABLE students ADD COLUMN  school_email VARCHAR(50)")

# Update random emails
cursor.execute("SELECT student_id, name FROM students")
students = cursor.fetchall()

for sid, name in students:
    email = name.lower() + str(random.randint(1,100)) + "@school.com"
    cursor.execute("UPDATE students SET school_email=%s WHERE student_id=%s", (email, sid))

conn.commit()

In [ ]:
#12. Add a new column email to the students table using Python and update it with random values.
import mysql.connector


cursor = conn.cursor()

# Delete students with id between 101 and 200
cursor.execute("""
DELETE FROM students
WHERE student_id BETWEEN 101 AND 200;
""")

conn.commit()

print(" Duplicate students (IDs 101-200) deleted successfully.")

cursor.execute("SELECT student_id, name, age, grade, email FROM students ORDER BY student_id")
for row in cursor.fetchall():
    print(row)

 Duplicate students (IDs 101-200) deleted successfully.
(1, 'Zane1', 18, 'C', 'zane149@school.com')
(2, 'Uma2', 23, 'A', 'uma254@school.com')
(3, 'Wendy3', 22, 'B', 'wendy342@school.com')
(4, 'Xander4', 22, 'A', 'xander457@school.com')
(5, 'Victor5', 19, 'A', 'victor592@school.com')
(6, 'Ian6', 19, 'D', 'ian688@school.com')
(7, 'Leo7', 22, 'A', 'leo779@school.com')
(8, 'Paul8', 24, 'B', 'paul841@school.com')
(9, 'Wendy9', 23, 'B', 'wendy946@school.com')
(10, 'Leo10', 23, 'A', 'leo1045@school.com')
(11, 'Uma11', 18, 'C', 'uma1197@school.com')
(12, 'Rita12', 18, 'B', 'rita1234@school.com')
(13, 'Yara13', 22, 'B', 'yara1324@school.com')
(14, 'Bob14', 19, 'C', 'bob1437@school.com')
(15, 'Quincy15', 24, 'A', 'quincy1568@school.com')
(16, 'Tina16', 19, 'A', 'tina1652@school.com')
(17, 'Alice17', 25, 'B', 'alice1785@school.com')
(18, 'Sam18', 20, 'B', 'sam1812@school.com')
(19, 'Paul19', 23, 'A', 'paul1942@school.com')
(20, 'Victor20', 19, 'D', 'victor2032@school.com')
(21, 'Frank21', 23, 'A', 'frank2110@school.com')
(22, 'Victor22', 18, 'A', 'victor2282@school.com')
(23, 'Karen23', 25, 'A', 'karen2315@school.com')
(24, 'Grace24', 24, 'D', 'grace2472@school.com')
(25, 'Quincy25', 25, 'A', 'quincy2517@school.com')
(26, 'Mona26', 20, 'D', 'mona2678@school.com')
(27, 'Uma27', 22, 'B', 'uma2786@school.com')
(28, 'Nina28', 23, 'B', 'nina2861@school.com')
(29, 'Ian29', 23, 'B', 'ian2973@school.com')
(30, 'Tina30', 23, 'A', 'tina3025@school.com')
(31, 'Nina31', 22, 'B', 'nina318@school.com')
(32, 'Hannah32', 21, 'A', 'hannah3256@school.com')
(33, 'David33', 25, 'D', 'david3347@school.com')
(34, 'Wendy34', 22, 'B', 'wendy3490@school.com')
(35, 'Frank35', 25, 'C', 'frank3527@school.com')
(36, 'Paul36', 22, 'D', 'paul3628@school.com')
(37, 'Ian37', 21, 'D', 'ian3793@school.com')
(38, 'Paul38', 20, 'C', 'paul3897@school.com')
(39, 'Hannah39', 18, 'A', 'hannah3982@school.com')
(40, 'Zane40', 21, 'A', 'zane4017@school.com')
(41, 'Ian41', 24, 'D', 'ian41100@school.com')
(42, 'Quincy42', 24, 'C', 'quincy4215@school.com')
(43, 'Quincy43', 25, 'D', 'quincy4312@school.com')
(44, 'Tina44', 19, 'C', 'tina4444@school.com')
(45, 'Xander45', 23, 'C', 'xander4560@school.com')
(46, 'Zane46', 25, 'C', 'zane4632@school.com')
(47, 'Eva47', 19, 'D', 'eva4718@school.com')
(48, 'Leo48', 22, 'B', 'leo4847@school.com')
(49, 'Uma49', 25, 'A', 'uma4966@school.com')
(50, 'Bob50', 22, 'D', 'bob5041@school.com')
(51, 'Karen51', 18, 'A', 'karen5197@school.com')
(52, 'Hannah52', 23, 'A', 'hannah5259@school.com')
(53, 'Bob53', 21, 'C', 'bob5354@school.com')
(54, 'Leo54', 18, 'C', 'leo5426@school.com')
(55, 'Yara55', 22, 'A', 'yara5546@school.com')
(56, 'Eva56', 19, 'C', 'eva569@school.com')
(57, 'Nina57', 21, 'B', 'nina572@school.com')
(58, 'Eva58', 20, 'A', 'eva5835@school.com')
(59, 'Oscar59', 21, 'B', 'oscar591@school.com')
(60, 'Yara60', 18, 'B', 'yara6031@school.com')
(61, 'Oscar61', 23, 'D', 'oscar618@school.com')
(62, 'Rita62', 23, 'C', 'rita6264@school.com')
(63, 'Victor63', 20, 'D', 'victor6329@school.com')
(64, 'Xander64', 19, 'D', 'xander6467@school.com')
(65, 'Hannah65', 22, 'D', 'hannah6552@school.com')
(66, 'Nina66', 25, 'D', 'nina6651@school.com')
(67, 'Victor67', 18, 'A', 'victor6738@school.com')
(68, 'Karen68', 18, 'A', 'karen6876@school.com')
(69, 'Grace69', 18, 'D', 'grace694@school.com')
(70, 'Jack70', 24, 'A', 'jack7070@school.com')
(71, 'Nina71', 23, 'B', 'nina7115@school.com')
(72, 'Ian72', 22, 'D', 'ian7238@school.com')
(73, 'Grace73', 19, 'A', 'grace7369@school.com')
(74, 'Grace74', 24, 'C', 'grace7467@school.com')
(75, 'Quincy75', 23, 'D', 'quincy7569@school.com')
(76, 'Oscar76', 19, 'D', 'oscar7617@school.com')
(77, 'Grace77', 22, 'D', 'grace7770@school.com')
(78, 'Ian78', 22, 'D', 'ian7836@school.com')
(79, 'Xander79', 24, 'C', 'xander7975@school.com')
(80, 'Tina80', 22, 'D', 'tina8097@school.com')
(81, 'Wendy81', 20, 'A', 'wendy8111@school.com')
(82, 'Karen82', 23, 'B', 'karen8295@school.com')
(83, 'Leo83', 18, 'C', 'leo8360@school.com')
(84, 'Bob84', 18, 'A', 'bob8446@school.com')
(85, 'Rita85', 18, 'A', 'rita8526@school.com')
(86, 'Alice86', 21, 'B', 'alice8639@school.com')
(87, 'Sam87', 19, 'C', 'sam8780@school.com')
(88, 'Wendy88', 23, 'A', 'wendy8858@school.com')
(89, 'Tina89', 21, 'C', 'tina8979@school.com')
(90, 'Zane90', 25, 'D', 'zane9073@school.com')
(91, 'Tina91', 21, 'D', 'tina917@school.com')
(92, 'Wendy92', 19, 'C', 'wendy9277@school.com')
(93, 'Quincy93', 19, 'A', 'quincy9313@school.com')
(94, 'Eva94', 24, 'C', 'eva9470@school.com')
(95, 'Tina95', 25, 'D', 'tina9561@school.com')
(96, 'Ian96', 25, 'C', 'ian961@school.com')
(97, 'Mona97', 22, 'C', 'mona9756@school.com')
(99, 'Bob99', 23, 'B+', 'bob9925@school.com')
(100, 'Paul100', 19, 'B', 'paul10052@school.com')

In [ ]:
#13.Create a program to count how many students are enrolled per course and display results in descending order.
import mysql.connector

cursor = conn.cursor()

cursor.execute("""
SELECT c.course_id, c.course_name, COUNT(e.student_id) AS total_students
FROM courses c
LEFT JOIN enrollments e ON c.course_id = e.course_id
GROUP BY c.course_id, c.course_name
ORDER BY total_students DESC;
""")

print("Course ID | Course Name   | Students Enrolled")
print("-------------------------------------------------")
for row in cursor.fetchall():
    print(f"{row[0]:<9} | {row[1]:<18} | {row[2]}")

Course ID | Course Name   | Students Enrolled
-------------------------------------------------
1         | Mathematics        | 1
2         | Physics            | 1
3         | Chemistry          | 1
4         | Biology            | 1
5         | History            | 1
6         | Economics          | 0
7         | Computer Science   | 0
8         | English Literature | 0
9         | Philosophy         | 0
10        | Statistics         | 0

In [ ]:
#14.Write a Python script that accepts a course name as input and returns all enrolled students with their grades. 
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",   
    database="schools_db"    
)

cursor = conn.cursor()

course_name = input("Enter course name: ")

query = """
SELECT s.student_id, s.name, s.grade
FROM students s
JOIN enrollments e ON s.student_id = e.student_id
JOIN courses c ON e.course_id = c.course_id
WHERE c.course_name = %s
"""
cursor.execute(query, (course_name,))
rows = cursor.fetchall()

if rows:
    print(f"Students enrolled in {course_name}:")
    for r in rows:
        print(f"ID: {r[0]}, Name: {r[1]}, Grade: {r[2]}")
else:
    print(f"No students found for the course '{course_name}'.")

Students enrolled in chemistry:
ID: 3, Name: Wendy3, Grade: B
ID: 5, Name: Victor5, Grade: A
ID: 10, Name: Leo10, Grade: A
ID: 11, Name: Uma11, Grade: C
ID: 14, Name: Bob14, Grade: C
ID: 18, Name: Sam18, Grade: B
ID: 22, Name: Victor22, Grade: A
ID: 28, Name: Nina28, Grade: B
ID: 29, Name: Ian29, Grade: B
ID: 30, Name: Tina30, Grade: A
ID: 31, Name: Nina31, Grade: B
ID: 34, Name: Wendy34, Grade: B
ID: 41, Name: Ian41, Grade: D
ID: 52, Name: Hannah52, Grade: A
ID: 54, Name: Leo54, Grade: C
ID: 64, Name: Xander64, Grade: D
ID: 65, Name: Hannah65, Grade: D
ID: 66, Name: Nina66, Grade: D
ID: 68, Name: Karen68, Grade: A
ID: 69, Name: Grace69, Grade: D
ID: 72, Name: Ian72, Grade: D
ID: 79, Name: Xander79, Grade: C
ID: 82, Name: Karen82, Grade: B
ID: 83, Name: Leo83, Grade: C
ID: 84, Name: Bob84, Grade: A
ID: 86, Name: Alice86, Grade: B
ID: 93, Name: Quincy93, Grade: A
ID: 95, Name: Tina95, Grade: D
ID: 98, Name: Leo98, Grade: A

In [ ]:
#15. Export the contents of the students table into a CSV file using Python.
import mysql.connector
import csv

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",  
    database="schools_db"     
)

cursor = conn.cursor()

cursor.execute("SELECT * FROM students")
rows = cursor.fetchall()

column_names = [i[0] for i in cursor.description]

with open("students_export.csv", "w", newline="", encoding="utf-8") as f:
    writer = csv.writer(f)
    
    writer.writerow(column_names)
    
    writer.writerows(rows)

print(" Students table exported successfully to students_export.csv")

 Students table exported successfully to students_export.csv

In [ ]:
#16.Write a Python program to import student data from a CSV file into the students table. 
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",   
    database="schools_db"    
)

cursor = conn.cursor()

with open("./students.csv", "r", encoding="utf-8") as f:
    reader = csv.reader(f)
    
    next(reader)
    
    for row in reader:
        student_id, name, age, grade, email = row 
        cursor.execute("""
    INSERT IGNORE INTO students (student_id, name, age, grade, email)
    VALUES (%s, %s, %s, %s, %s)
""", (student_id, name, age, grade, email))
        
conn.commit()

print(" Students data imported successfully from CSV!")

cursor.close()
conn.close()

âš ï¸ No data found in students.csv

In [10]:
#17.Create a stored procedure in MySQL (e.g., GetStudentCourses(student_id)) and call it from Python.
import mysql.connector

# Establish connection to the database
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="tamrapathi3383",
    database="schools_db"  # Make sure database is selected
)

mycursor = conn.cursor()

# Create the stored procedure using Python
proc = """
CREATE PROCEDURE GetStudentCourses(IN sid INT)
BEGIN
    SELECT s.name, c.course_name
    FROM enrollments e
    JOIN students s ON e.student_id = s.student_id
    JOIN courses c ON e.course_id = c.course_id
    WHERE s.student_id = sid;
END
"""

try:
    mycursor.execute("DROP PROCEDURE IF EXISTS GetStudentCourses")
    mycursor.execute(proc)
    conn.commit()
    print("Stored procedure 'GetStudentCourses' created successfully.")
except Exception as e:
    print("Error creating procedure:", e)

# Call the stored procedure
try:
    mycursor.callproc('GetStudentCourses', [1])  # Pass student_id = 1
    
    for result in mycursor.fetchall():
        print(result)
        
except Exception as e:
    print("Error calling procedure:", e)

finally:
    mycursor.close()
    conn.close()

Stored procedure 'GetStudentCourses' created successfully.

In [17]:
#18. Handle exceptions in Python to gracefully catch duplicate entries (e.g. inserting a student with the same ID). 
import mysql.connector
from mysql.connector import Error

def insert_student(student_id, name, age, grade):
    conn = None
    cursor = None
    try:
        conn = mysql.connector.connect(
            host="localhost", 
            user="root", 
            password="tamrapathi3383",  # Use correct password
            database="schools_db"  # Use correct database name
        )
        cursor = conn.cursor()
        cursor.execute(
            "INSERT INTO students (student_id, name, age, grade) VALUES (%s, %s, %s, %s)", 
            (student_id, name, age, grade)
        )
        conn.commit()
        print("âœ… Student inserted successfully")
        
    except mysql.connector.errors.IntegrityError as e:
        print(f"Duplicate entry found: student_id {student_id} already exists")
        
    except Error as e:
        print(f"Error: {e}")
        
    finally:
        if cursor is not None:
            cursor.close()
        if conn is not None and conn.is_connected():
            conn.close()

insert_student(1, "Surya", 21, "A")  # Example

Duplicate entry found: student_id 1 already exists

In [39]:
#19. Write a program to implement transactions in Python: 
# Insert a student 
# Enroll them in a course 
import mysql.connector

def transaction_example():
    conn = None
    cursor = None
    try:
        conn = mysql.connector.connect(
            host="localhost", 
            user="root", 
            password="tamrapathi3383",
            database="schools_db"
        )
        cursor = conn.cursor()
        
        # Start transaction
        conn.start_transaction()

        # Insert new student with explicit student_id
        cursor.execute("INSERT INTO students (student_id, name, age, grade) VALUES (%s, %s, %s, %s)", (888, "NewStudent", 20, "B"))

        # Enroll them in a course (use valid course_id)
        cursor.execute("INSERT INTO enrollments (enroll_id, student_id, course_id) VALUES (%s, %s, %s)", (888, 888, 1))

        conn.commit()
        print("Transaction successful")
    except Exception as e:
        if conn is not None:
            conn.rollback()
        print("Transaction failed Rolled back.", e)
    finally:
        if cursor is not None:
            cursor.close()
        if conn is not None and conn.is_connected():
            conn.close()

transaction_example()

Transaction failed Rolled back. 1062 (23000): Duplicate entry '888' for key 'students.PRIMARY'

In [16]:
#20.Close the database connection safely in Python, ensuring both cursor and connection are properly closed.
import mysql.connector
from mysql.connector import Error

def safe_close():
    conn = None
    cursor = None
    try:
        conn = mysql.connector.connect(
            host="localhost", 
            user="root", 
            password="tamrapathi3383",  # Use correct password
            database="schools_db"  # Use correct database name
        )
        cursor = conn.cursor()
        cursor.execute("SELECT COUNT(*) FROM students")
        count = cursor.fetchone()[0]
        print(f"âœ… Students count: {count}")
        
    except Error as e:
        print(f"âŒ Error: {e}")
        
    finally:
        # Safely close cursor
        if cursor is not None:
            cursor.close()
            print("âœ… Cursor closed")
        
        # Safely close connection
        if conn is not None and conn.is_connected():
            conn.close()
            print("âœ… Connection closed safely")

safe_close()

âœ… Students count: 101
âœ… Cursor closed
âœ… Connection closed safely